indexxue/TM4C123GH6PM/Common/src/proto.c
/**
 * @file    proto.c
 * @brief   UART0 蓝牙协议：帧解析、HELLO/PING、遥测、参数读写、遥控
 */

#include "proto.h"

#include "attitude.h"
#include "battery.h"
#include "board.h"
#include "chassis.h"
#include "cfg.h"
#include "device_profile.h"
#include "log.h"
#include "nvs.h"
#include "led_scene.h"
#include "ultrasonic.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"
#include "task.h"

#include "driverlib/uart.h"
#include "inc/hw_memmap.h"

#include <string.h>

/* -------------------------------------------------------------------------- */
/* 协议常量                                                                   */
/* -------------------------------------------------------------------------- */

#define PROTO_SOF0                  0x54U
#define PROTO_SOF1                  0x4DU
#define PROTO_VER                   0x02U
#define PROTO_HEADER_SIZE           7U
#define PROTO_MAX_PAYLOAD           256U
#define PROTO_RESPONSE_BIT          0x8000U

#define PROTO_FLAG_DIR_DEVICE       0x01U
#define PROTO_FLAG_NAK              0x02U
#define PROTO_FLAG_UNSOLICITED      0x04U

#define PROTO_CMD_HELLO             0x0001U
#define PROTO_CMD_PING              0x0002U
#define PROTO_CMD_GET_TELEMETRY     0x0010U
#define PROTO_CMD_SUBSCRIBE         0x0011U
#define PROTO_CMD_UNSUBSCRIBE       0x0012U
#define PROTO_CMD_TELEMETRY_PUSH    0x8011U
#define PROTO_CMD_PARAM_LIST        0x0020U
#define PROTO_CMD_PARAM_READ        0x0021U
#define PROTO_CMD_PARAM_WRITE       0x0022U
#define PROTO_CMD_DRIVE             0x0030U
#define PROTO_CMD_DRIVE_STOP        0x0031U
#define PROTO_CMD_SET_SPEED         0x0032U
#define PROTO_CMD_SPEED_STOP        0x0033U
#define PROTO_CMD_SET_ANGLE         0x0034U
#define PROTO_CMD_ANGLE_STOP        0x0035U
#define PROTO_CMD_CALIB_YAW         0x0036U
#define PROTO_CMD_SET_DISTANCE      0x0037U
#define PROTO_CMD_DISTANCE_STOP     0x0038U

#define PROTO_ERR_UNKNOWN_CMD       0x02U
#define PROTO_ERR_BAD_LEN           0x03U
#define PROTO_ERR_PARAM_ID_INVALID  0x04U
#define PROTO_ERR_PARAM_READ_ONLY   0x05U
#define PROTO_ERR_PARAM_VALUE_INVALID 0x06U
#define PROTO_ERR_NVS_WRITE_FAIL    0x07U
#define PROTO_ERR_BUSY              0x08U
#define PROTO_ERR_UNSUPPORTED       0x09U

#define PROTO_CAP_TELEMETRY         (1U << 0)
#define PROTO_CAP_PARAM_RW          (1U << 1)
#define PROTO_CAP_SUBSCRIBE         (1U << 2)
#define PROTO_CAP_DRIVE             (1U << 3)
#define PROTO_CAP_SPEED_LOOP        (1U << 4)
#define PROTO_CAP_ANGLE_LOOP        (1U << 5)
#define PROTO_CAP_YAW_CALIB         (1U << 6)
#define PROTO_CAP_DISTANCE_LOOP     (1U << 7)

#define PROTO_CH_BATTERY            (1U << 0)
#define PROTO_CH_ATTITUDE           (1U << 1)
#define PROTO_CH_ENCODER            (1U << 2)
#define PROTO_CH_LINE_ADC           (1U << 3)
#define PROTO_CH_ULTRASONIC         (1U << 4)
#define PROTO_CH_MOTOR_RPM          (1U << 5)
#define PROTO_CH_ANGLE_LOOP         (1U << 6)
#define PROTO_CH_DISTANCE_LOOP      (1U << 7)

#define PROTO_BASE_MASK             (PROTO_CH_ATTITUDE | PROTO_CH_ENCODER)
#define PROTO_OPTIONAL_MASK         (PROTO_CH_BATTERY | PROTO_CH_LINE_ADC | PROTO_CH_ULTRASONIC | \
                                     PROTO_CH_MOTOR_RPM | PROTO_CH_ANGLE_LOOP | PROTO_CH_DISTANCE_LOOP)

#define PROTO_PUSH_CH_BATTERY       0U
#define PROTO_PUSH_CH_ATTITUDE      1U
#define PROTO_PUSH_CH_ENCODER       2U
#define PROTO_PUSH_CH_LINE_ADC      3U
#define PROTO_PUSH_CH_ULTRASONIC    4U
#define PROTO_PUSH_CH_MOTOR_RPM     5U
#define PROTO_PUSH_CH_ANGLE_LOOP    6U
#define PROTO_PUSH_CH_DISTANCE_LOOP 7U

#define PROTO_DEFAULT_HZ_ATT        10U
#define PROTO_DEFAULT_HZ_ENC        5U
#define PROTO_DEFAULT_HZ_BATT       1U
#define PROTO_DEFAULT_HZ_LINE         5U
#define PROTO_DEFAULT_HZ_ULTRA      5U
#define PROTO_DEFAULT_HZ_MOTOR_RPM  10U
#define PROTO_DEFAULT_HZ_ANGLE_LOOP 10U
#define PROTO_DEFAULT_HZ_DISTANCE_LOOP 10U
#define PROTO_PUSH_SUPPRESS_MS      280U
#define PROTO_PUSH_SUPPRESS_SET_SPEED_FMT0_MS  350U
#define PROTO_PUSH_SUPPRESS_SET_SPEED_FMT_LR_MS 350U
#define PROTO_PUSH_SUPPRESS_SET_ANGLE_MS       60U
#define PROTO_PUSH_SUPPRESS_SET_DISTANCE_MS    350U

/** 与 app.c APP_CTRL_PERIOD_MS 一致，SET_SPEED 后立即 tick 用 */
#define PROTO_CHASSIS_TICK_MS       20U

/** 超声波未连接/未就绪/测距失败时的占位距离（mm） */
#define PROTO_ULTRA_INVALID_MM      9999U

#define PROTO_DRIVE_TIMEOUT_MS      500U
#define PROTO_DRIVE_THROTTLE_MAX    1000
#define PROTO_DRIVE_STEER_MAX       1000

#define PROTO_TASK_NAME_RX          "proto_rx"
#define PROTO_RX_STACK_WORDS        (768U)
#define PROTO_RX_PRIORITY           (4U)
#define PROTO_RX_POLL_MS            (1U)
#define PROTO_RX_GATE_MS            (30U)
#define PROTO_RX_GATE_CMD_MS        120U

#define PROTO_TASK_NAME_TX          "proto_tx"
#define PROTO_TX_STACK_WORDS        (512U)
#define PROTO_TX_PRIORITY           (2U)
#define PROTO_TX_QUEUE_LEN          (16U)
#define PROTO_TX_MAX_FRAME          (2U + PROTO_HEADER_SIZE + PROTO_MAX_PAYLOAD + 2U)

#define PROTO_LINE_ADC_COUNT        LINE_SENSOR_COUNT
#define PROTO_ENCODER_COUNT         4U

/* -------------------------------------------------------------------------- */
/* 参数元数据                                                                 */
/* -------------------------------------------------------------------------- */

typedef status_t (*proto_param_write_fn)(const uint8_t *data, uint16_t len);

typedef struct {
    nvs_param_id_t id;
    uint8_t size;
    proto_param_write_fn write_fn;
} proto_param_desc_t;

/* -------------------------------------------------------------------------- */
/* 模块状态                                                                   */
/* -------------------------------------------------------------------------- */

typedef struct {
    uint16_t len;
    uint8_t bytes[PROTO_TX_MAX_FRAME];
} proto_tx_item_t;

static TaskHandle_t s_rx_task;
static TaskHandle_t s_tx_task;
static QueueHandle_t s_tx_queue;
static SemaphoreHandle_t s_tx_mutex;
static volatile bool_t s_echo_mode;

static struct {
    bool_t active;
    uint8_t hz_att;
    uint8_t hz_enc;
    uint32_t acc_att_ms;
    uint32_t acc_enc_ms;
} s_base;

