indexxue/TM4C123GH6PM/Common/src/proto.c
static struct {
    uint32_t mask;
    uint8_t hz_batt;
    uint8_t hz_line;
    uint8_t hz_ultra;
    uint8_t hz_motor_rpm;
    uint8_t hz_angle_loop;
    uint8_t hz_distance_loop;
    uint32_t acc_batt_ms;
    uint32_t acc_line_ms;
    uint32_t acc_ultra_ms;
    uint32_t acc_motor_rpm_ms;
    uint32_t acc_angle_loop_ms;
    uint32_t acc_distance_loop_ms;
} s_sub;

static bool_t s_ultra_ready;
static bool_t s_ultra_init_attempted;

static volatile bool s_drive_active;
static volatile bool s_drive_stop_req;
static volatile int16_t s_drive_throttle;
static volatile int16_t s_drive_steer;
static volatile uint32_t s_drive_last_ms;

typedef enum {
    PROTO_PARSE_SOF0 = 0,
    PROTO_PARSE_SOF1,
    PROTO_PARSE_BODY,
} proto_parse_state_t;

static struct {
    proto_parse_state_t state;
    uint8_t body[PROTO_HEADER_SIZE + PROTO_MAX_PAYLOAD + 2U];
    uint16_t body_len;
} s_parser;

static volatile uint32_t s_rx_gate_until_ms;
static volatile uint32_t s_push_suppress_until_ms;

static bool_t proto_host_rx_active(void);
static void proto_rx_gate_hold(void);
static bool_t proto_push_blocked(void);
static void proto_suppress_pushes(uint32_t ms);

/* -------------------------------------------------------------------------- */
/* CRC16-CCITT-FALSE                                                          */
/* -------------------------------------------------------------------------- */

static uint16_t proto_crc16_ccitt_false(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU;
    uint16_t i;
    uint8_t bit;

    for (i = 0U; i < len; i++) {
        crc ^= (uint16_t)data[i] << 8;
        for (bit = 0U; bit < 8U; bit++) {
            if ((crc & 0x8000U) != 0U) {
                crc = (uint16_t)((crc << 1) ^ 0x1021U);
            } else {
                crc <<= 1;
            }
        }
    }
    return crc;
}

/* -------------------------------------------------------------------------- */
/* 字节序辅助                                                                 */
/* -------------------------------------------------------------------------- */

static uint32_t proto_uptime_ms(void)
{
    return (uint32_t)(xTaskGetTickCount() * portTICK_PERIOD_MS);
}

static void proto_put_u16(uint8_t *p, uint16_t v)
{
    p[0] = (uint8_t)(v & 0xFFU);
    p[1] = (uint8_t)((v >> 8) & 0xFFU);
}

static void proto_put_u32(uint8_t *p, uint32_t v)
{
    p[0] = (uint8_t)(v & 0xFFU);
    p[1] = (uint8_t)((v >> 8) & 0xFFU);
    p[2] = (uint8_t)((v >> 16) & 0xFFU);
    p[3] = (uint8_t)((v >> 24) & 0xFFU);
}

static void proto_put_i16(uint8_t *p, int16_t v)
{
    proto_put_u16(p, (uint16_t)v);
}

static void proto_put_i32(uint8_t *p, int32_t v)
{
    proto_put_u32(p, (uint32_t)v);
}

static uint16_t proto_get_u16(const uint8_t *p)
{
    return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static uint32_t proto_get_u32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static int16_t proto_get_i16(const uint8_t *p)
{
    return (int16_t)proto_get_u16(p);
}

static int32_t proto_get_i32(const uint8_t *p)
{
    return (int32_t)proto_get_u32(p);
}

/* -------------------------------------------------------------------------- */
/* UART0 发送                                                                 */
/* -------------------------------------------------------------------------- */

static void proto_uart_write_locked(const uint8_t *data, uint16_t len)
{
    uint16_t i;

    if ((data == NULL) || (len == 0U)) {
        return;
    }
    for (i = 0U; i < len; i++) {
        UART_Putc((char)data[i]);
    }
    UART_Flush();
}

static bool_t proto_tx_lock(void)
{
    if (s_tx_mutex == NULL) {
        return TRUE;
    }
    return xSemaphoreTake(s_tx_mutex, portMAX_DELAY) == pdTRUE;
}

static void proto_tx_unlock(void)
{
    if (s_tx_mutex != NULL) {
        (void)xSemaphoreGive(s_tx_mutex);
    }
}

static void proto_tx_task(void *arg)
{
    proto_tx_item_t item;

    (void)arg;

    for (;;) {
        if (xQueueReceive(s_tx_queue, &item, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        while (proto_host_rx_active()) {
            vTaskDelay(pdMS_TO_TICKS(1U));
        }
        if (!proto_tx_lock()) {
            continue;
        }
        proto_uart_write_locked(item.bytes, item.len);
        proto_tx_unlock();
    }
}

static bool_t proto_uart_rx_pending(void)
{
    return UARTCharsAvail(UART0_BASE) ? TRUE : FALSE;
}

static void proto_rx_gate_hold(void)
{
    s_rx_gate_until_ms = proto_uptime_ms() + PROTO_RX_GATE_MS;
}

static void proto_rx_gate_hold_cmd(void)
{
    s_rx_gate_until_ms = proto_uptime_ms() + PROTO_RX_GATE_CMD_MS;
}

static bool_t proto_push_blocked(void)
{
    if (proto_host_rx_active()) {
        return TRUE;
    }
    if (proto_uptime_ms() < s_push_suppress_until_ms) {
        return TRUE;
    }
    return FALSE;
}

static void proto_suppress_pushes(uint32_t ms)
{
    s_push_suppress_until_ms = proto_uptime_ms() + ms;
}

static bool_t proto_host_rx_active(void)
{
    if (s_parser.state != PROTO_PARSE_SOF0) {
        return TRUE;
    }
    if (proto_uart_rx_pending()) {
        return TRUE;
    }
    if (proto_uptime_ms() < s_rx_gate_until_ms) {
        return TRUE;
    }
    return FALSE;
}

static bool_t proto_build_frame(uint8_t *frame, uint16_t *total_out, uint16_t cmd, uint8_t seq,
                                const uint8_t *payload, uint16_t len, uint8_t extra_flags)
{
    uint8_t *body;
    uint16_t crc;
    uint16_t total;
    uint8_t flags = (uint8_t)(PROTO_FLAG_DIR_DEVICE | extra_flags);

    if ((frame == NULL) || (total_out == NULL) || (len > PROTO_MAX_PAYLOAD)) {
        return FALSE;
    }

    frame[0] = PROTO_SOF0;
    frame[1] = PROTO_SOF1;
    body = &frame[2];
    body[0] = PROTO_VER;
    body[1] = flags;
    proto_put_u16(&body[2], len);
    proto_put_u16(&body[4], cmd);
    body[6] = seq;
    if ((len > 0U) && (payload != NULL)) {
        (void)memcpy(&body[7], payload, len);
    }

    crc = proto_crc16_ccitt_false(body, (uint16_t)(PROTO_HEADER_SIZE + len));
    proto_put_u16(&body[7 + len], crc);
    total = (uint16_t)(2U + PROTO_HEADER_SIZE + len + 2U);
    *total_out = total;
    return TRUE;
}

static bool_t proto_enqueue_frame_bytes(const uint8_t *frame, uint16_t len, bool_t to_front)
{
    proto_tx_item_t item;
    BaseType_t ok;

    if ((frame == NULL) || (len == 0U) || (len > PROTO_TX_MAX_FRAME) || (s_tx_queue == NULL)) {
        return FALSE;
    }

    item.len = len;
    (void)memcpy(item.bytes, frame, len);
    if (to_front) {
        ok = xQueueSendToFront(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    } else {
        ok = xQueueSend(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    }
    if (ok != pdTRUE) {
        LOG_WARN("proto: tx queue full drop %uB", (unsigned)len);
        return FALSE;
    }
    return TRUE;
}

