indexxue/TM4C123GH6PM/Common/src/proto.c
static bool_t proto_uart_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                                    uint8_t extra_flags, bool_t immediate, bool_t queue_front)
{
    uint8_t frame[PROTO_TX_MAX_FRAME];
    uint16_t total;

    if (!proto_build_frame(frame, &total, cmd, seq, payload, len, extra_flags)) {
        return FALSE;
    }

    if (immediate) {
        if (!proto_tx_lock()) {
            return FALSE;
        }
        proto_uart_write_locked(frame, total);
        proto_tx_unlock();
        return TRUE;
    }

    return proto_enqueue_frame_bytes(frame, total, queue_front);
}

static bool_t proto_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                               uint8_t extra_flags)
{
    return proto_uart_send_frame(cmd, seq, payload, len, extra_flags, FALSE, FALSE);
}

static void proto_reply_ack(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, TRUE, FALSE)) {
        LOG_WARN("proto: reply ack immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, FALSE, TRUE);
    }
}

static void proto_reply_nak(uint16_t cmd, uint8_t seq, uint8_t err_code)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, TRUE, FALSE)) {
        LOG_WARN("proto: reply nak immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, FALSE, TRUE);
    }
}

static void proto_push_frame(const uint8_t *payload, uint16_t len)
{
    proto_send_frame(PROTO_CMD_TELEMETRY_PUSH, 0U, payload, len, PROTO_FLAG_UNSOLICITED);
}

/* -------------------------------------------------------------------------- */
/* 参数写入适配                                                               */
/* -------------------------------------------------------------------------- */

static status_t proto_write_fw_version(const uint8_t *data, uint16_t len)
{
    char ver[NVS_CFG_FW_VER_MAX];

    if ((data == NULL) || (len == 0U) || (len >= NVS_CFG_FW_VER_MAX)) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(ver, data, len);
    ver[len] = '\0';
    return nvs_param_set_fw_version(ver, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_pid_speed(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_speed(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_line(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    return nvs_param_set_pid_line(&pid, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_pid_yaw(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_yaw(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_angle_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_dist(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_dist(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_distance_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_spd_limit(const uint8_t *data, uint16_t len)
{
    nvs_spd_limit_t limit;

    if ((data == NULL) || (len != sizeof(nvs_spd_limit_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&limit, data, sizeof(limit));
    return nvs_param_set_spd_limit(&limit, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_kinematics(const uint8_t *data, uint16_t len)
{
    nvs_kinematics_t kinem;

    if ((data == NULL) || (len != sizeof(nvs_kinematics_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&kinem, data, sizeof(kinem));
    return nvs_param_set_kinematics(&kinem, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_motor_dir(const uint8_t *data, uint16_t len)
{
    u32_t mask;

    if ((data == NULL) || (len != sizeof(u32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&mask, data, sizeof(mask));
    return nvs_param_set_motor_dir_mask(mask, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_encoder_dir(const uint8_t *data, uint16_t len)
{
    u32_t mask;

    if ((data == NULL) || (len != sizeof(u32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&mask, data, sizeof(mask));
    return nvs_param_set_encoder_dir_mask(mask, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_imu_offset(const uint8_t *data, uint16_t len)
{
    nvs_imu_offset_t offset;

    if ((data == NULL) || (len != sizeof(nvs_imu_offset_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&offset, data, sizeof(offset));
    return nvs_param_set_imu_offset(&offset, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_line_threshold(const uint8_t *data, uint16_t len)
{
    nvs_line_threshold_t threshold;

    if ((data == NULL) || (len != sizeof(nvs_line_threshold_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&threshold, data, sizeof(threshold));
    return nvs_param_set_line_threshold(&threshold, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_encoder_zero(const uint8_t *data, uint16_t len)
{
    nvs_encoder_zero_t zero;

    if ((data == NULL) || (len != sizeof(nvs_encoder_zero_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&zero, data, sizeof(zero));
    return nvs_param_set_encoder_zero(&zero, NVS_WRITE_SRC_PROTOCOL);
}

