indexxue/TM4C123GH6PM/Common/src/proto.c
static void proto_push_ultrasonic(void)
{
    uint8_t payload[5U + 2U];
    uint16_t mm = proto_sample_ultrasonic_mm();

    payload[0] = PROTO_PUSH_CH_ULTRASONIC;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_u16(&payload[5], mm);
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

/* -------------------------------------------------------------------------- */
/* 遥控                                                                       */
/* -------------------------------------------------------------------------- */

static void proto_motor_all_stop(void)
{
    chassis_stop();
}

static void proto_apply_drive(int16_t throttle, int16_t steer)
{
    if (!device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR)) {
        return;
    }

    chassis_set_drive((int32_t)throttle, (int32_t)steer, PROTO_DRIVE_THROTTLE_MAX, PROTO_DRIVE_STEER_MAX);
}

static void proto_drive_stop_internal(void)
{
    s_drive_active = false;
    s_drive_stop_req = true;
}

/* -------------------------------------------------------------------------- */
/* 命令处理                                                                   */
/* -------------------------------------------------------------------------- */

static uint32_t proto_caps(void)
{
    uint32_t caps = PROTO_CAP_TELEMETRY | PROTO_CAP_PARAM_RW | PROTO_CAP_SUBSCRIBE;

    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR)) {
        caps |= PROTO_CAP_DRIVE;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER)) {
        caps |= PROTO_CAP_SPEED_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER |
                                   DEVICE_BOARD_MASK_PERIPH)) {
        caps |= PROTO_CAP_ANGLE_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER)) {
        caps |= PROTO_CAP_DISTANCE_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_PERIPH)) {
        caps |= PROTO_CAP_YAW_CALIB;
    }
    return caps;
}

static void proto_handle_hello(uint8_t seq)
{
    const nvs_cfg_t *cfg = nvs_cfg_get();
    uint8_t payload[1U + NVS_CFG_FW_VER_MAX + 8U];

    payload[0] = PROTO_VER;
    if (cfg != NULL) {
        (void)memcpy(&payload[1], cfg->fw_version, NVS_CFG_FW_VER_MAX);
        proto_put_u32(&payload[1U + NVS_CFG_FW_VER_MAX], cfg->hw_rev);
    } else {
        (void)memset(&payload[1], 0, NVS_CFG_FW_VER_MAX + 4U);
    }
    proto_put_u32(&payload[1U + NVS_CFG_FW_VER_MAX + 4U], proto_caps());
    proto_reply_ack(PROTO_CMD_HELLO, seq, payload, (uint16_t)sizeof(payload));
}

static void proto_handle_ping(uint8_t seq)
{
    uint8_t payload[4];

    proto_put_u32(payload, proto_uptime_ms());
    proto_reply_ack(PROTO_CMD_PING, seq, payload, (uint16_t)sizeof(payload));
}

static void proto_handle_get_telemetry(uint8_t seq)
{
    uint8_t payload[64];
    uint16_t len = proto_build_telemetry(payload, (uint16_t)sizeof(payload));

    if (len == 0U) {
        proto_reply_nak(PROTO_CMD_GET_TELEMETRY, seq, PROTO_ERR_BUSY);
        return;
    }
    proto_reply_ack(PROTO_CMD_GET_TELEMETRY, seq, payload, len);
}

static void proto_handle_subscribe(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint32_t mask;
    uint8_t hz_att;
    uint8_t hz_enc;
    uint8_t hz_line;
    uint8_t hz_ultra;
    uint8_t hz_motor_rpm;
    uint8_t hz_angle_loop;
    uint8_t hz_distance_loop;

    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_SUBSCRIBE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    LOG_INFO("proto: subscribe req seq=%u len=%u", (unsigned)seq, (unsigned)len);

    mask = proto_get_u32(&payload[0]);
    if (len >= 8U) {
        hz_att = payload[4];
        hz_enc = payload[5];
        hz_line = payload[6];
        hz_ultra = payload[7];
    } else {
        hz_att = PROTO_DEFAULT_HZ_ATT;
        hz_enc = 0U;
        hz_line = PROTO_DEFAULT_HZ_LINE;
        hz_ultra = 0U;
    }
    if (len >= 9U) {
        hz_motor_rpm = payload[8];
    } else if ((mask & PROTO_CH_MOTOR_RPM) != 0U) {
        hz_motor_rpm = PROTO_DEFAULT_HZ_MOTOR_RPM;
    } else {
        hz_motor_rpm = 0U;
    }
    if (len >= 10U) {
        hz_angle_loop = payload[9];
    } else if ((mask & PROTO_CH_ANGLE_LOOP) != 0U) {
        hz_angle_loop = PROTO_DEFAULT_HZ_ANGLE_LOOP;
    } else {
        hz_angle_loop = 0U;
    }
    if (len >= 11U) {
        hz_distance_loop = payload[10];
    } else if ((mask & PROTO_CH_DISTANCE_LOOP) != 0U) {
        hz_distance_loop = PROTO_DEFAULT_HZ_DISTANCE_LOOP;
    } else {
        hz_distance_loop = 0U;
    }

    /* 先 ACK 再开推送，避免与应答争用 TX 互斥/共享缓冲 */
    proto_reply_ack(PROTO_CMD_SUBSCRIBE, seq, NULL, 0U);
    LOG_INFO("proto: subscribe ack seq=%u mask=0x%08lx opt=0x%08lx",
             (unsigned)seq, (unsigned long)mask,
             (unsigned long)(mask & PROTO_OPTIONAL_MASK));

    if ((mask & PROTO_CH_ATTITUDE) != 0U) {
        s_base.hz_att = proto_effective_hz(hz_att, PROTO_DEFAULT_HZ_ATT);
    }
    if ((mask & PROTO_CH_ENCODER) != 0U) {
        s_base.hz_enc = proto_effective_hz(hz_enc, PROTO_DEFAULT_HZ_ENC);
    }
    s_base.active = TRUE;

    s_sub.mask = mask & PROTO_OPTIONAL_MASK;
    if ((s_sub.mask & PROTO_CH_BATTERY) != 0U) {
        s_sub.hz_batt = PROTO_DEFAULT_HZ_BATT;
    }
    s_sub.hz_line = hz_line;
    s_sub.hz_ultra = hz_ultra;
    s_sub.hz_motor_rpm = hz_motor_rpm;
    s_sub.hz_angle_loop = hz_angle_loop;
    s_sub.hz_distance_loop = hz_distance_loop;
    s_sub.acc_batt_ms = 0U;
    s_sub.acc_line_ms = 0U;
    s_sub.acc_ultra_ms = 0U;
    s_sub.acc_motor_rpm_ms = 0U;
    s_sub.acc_angle_loop_ms = 0U;
    s_sub.acc_distance_loop_ms = 0U;
}

static void proto_handle_unsubscribe(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint32_t mask;

    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_UNSUBSCRIBE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    mask = proto_get_u32(payload);
    if (mask == 0xFFFFFFFFU) {
        s_sub.mask = 0U;
    } else {
        s_sub.mask &= ~(mask & PROTO_OPTIONAL_MASK);
    }
    s_sub.acc_batt_ms = 0U;
    s_sub.acc_line_ms = 0U;
    s_sub.acc_ultra_ms = 0U;
    s_sub.acc_motor_rpm_ms = 0U;
    s_sub.acc_angle_loop_ms = 0U;
    s_sub.acc_distance_loop_ms = 0U;
    proto_reply_ack(PROTO_CMD_UNSUBSCRIBE, seq, NULL, 0U);
}

static void proto_handle_param_list(uint8_t seq)
{
    uint8_t payload[PROTO_PARAM_TABLE_COUNT * 8U];
    uint16_t off = 0U;
    uint16_t i;

    for (i = 0U; i < PROTO_PARAM_TABLE_COUNT; i++) {
        uint8_t flags = 0U;

        if (nvs_param_write_allowed(s_param_table[i].id, NVS_WRITE_SRC_PROTOCOL)) {
            flags = 1U;
        }
        proto_put_u16(&payload[off], (uint16_t)s_param_table[i].id);
        payload[off + 2U] = flags;
        payload[off + 3U] = s_param_table[i].size;
        payload[off + 4U] = 0U;
        payload[off + 5U] = 0U;
        off = (uint16_t)(off + 8U);
    }
    proto_reply_ack(PROTO_CMD_PARAM_LIST, seq, payload, off);
}

static void proto_handle_param_read(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    nvs_param_id_t id;
    uint8_t out[128];
    uint16_t out_len;

    if (len < 2U) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    id = (nvs_param_id_t)proto_get_u16(payload);
    if (proto_param_lookup(id) == NULL) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    out_len = proto_param_read_blob(id, out, (uint16_t)sizeof(out));
    if (out_len == 0U) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    proto_reply_ack(PROTO_CMD_PARAM_READ, seq, out, out_len);
}

static void proto_handle_param_write(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    nvs_param_id_t id;
    const proto_param_desc_t *desc;
    status_t st;

    if (len < 3U) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    id = (nvs_param_id_t)proto_get_u16(payload);
    desc = proto_param_lookup(id);
    if (desc == NULL) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    if ((desc->write_fn == NULL) ||
        !nvs_param_write_allowed(id, NVS_WRITE_SRC_PROTOCOL)) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_READ_ONLY);
        return;
    }
    if ((uint16_t)(len - 2U) != desc->size) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    st = desc->write_fn(&payload[2], desc->size);
    if (st == STATUS_INVALID_ARG) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    if (st != STATUS_OK) {
        if (st == STATUS_NOT_SUPPORTED) {
            proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_READ_ONLY);
        } else {
            proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_NVS_WRITE_FAIL);
        }
        return;
    }
    proto_reply_ack(PROTO_CMD_PARAM_WRITE, seq, NULL, 0U);
}

static void proto_handle_drive(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int16_t throttle;
    int16_t steer;

    if ((proto_caps() & PROTO_CAP_DRIVE) == 0U) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

