indexxue/TM4C123GH6PM/Common/src/proto.c
    throttle = proto_get_i16(&payload[0]);
    steer = proto_get_i16(&payload[2]);
    if ((throttle < -PROTO_DRIVE_THROTTLE_MAX) || (throttle > PROTO_DRIVE_THROTTLE_MAX) ||
        (steer < -PROTO_DRIVE_STEER_MAX) || (steer > PROTO_DRIVE_STEER_MAX)) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    s_drive_throttle = throttle;
    s_drive_steer = steer;
    s_drive_last_ms = proto_uptime_ms();
    s_drive_active = true;
    s_drive_stop_req = false;
    proto_reply_ack(PROTO_CMD_DRIVE, seq, NULL, 0U);
}

static void proto_handle_drive_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_DRIVE) == 0U) {
        proto_reply_nak(PROTO_CMD_DRIVE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    proto_drive_stop_internal();
    proto_reply_ack(PROTO_CMD_DRIVE_STOP, seq, NULL, 0U);
}

static void proto_handle_set_speed(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint8_t format;

    if ((proto_caps() & PROTO_CAP_SPEED_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len < 6U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        if ((payload[1] < 1U) || (payload[1] > PROTO_ENCODER_COUNT)) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_PARAM_VALUE_INVALID);
            return;
        }
        chassis_set_wheel_rpm(payload[1], proto_get_i32(&payload[2]));
        break;
    case 1U:
        if (len < 9U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        chassis_set_lr_rpm(proto_get_i32(&payload[1]), proto_get_i32(&payload[5]));
        break;
    case 2U:
        if (len < 17U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        chassis_set_wheel_rpm(1U, proto_get_i32(&payload[1]));
        chassis_set_wheel_rpm(2U, proto_get_i32(&payload[5]));
        chassis_set_wheel_rpm(3U, proto_get_i32(&payload[9]));
        chassis_set_wheel_rpm(4U, proto_get_i32(&payload[13]));
        break;
    default:
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    s_drive_active = false;
    s_drive_stop_req = false;
    if (format == 0U) {
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_SPEED_FMT0_MS);
    } else {
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_SPEED_FMT_LR_MS);
    }
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SET_SPEED, seq, NULL, 0U);
}

static void proto_handle_speed_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_SPEED_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SPEED_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SPEED_STOP, seq, NULL, 0U);
}

static void proto_handle_set_angle(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int16_t target_yaw;
    int32_t base_rpm;
    int32_t max_turn_rpm;

    if ((proto_caps() & PROTO_CAP_ANGLE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len < 7U) {
            proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        target_yaw = proto_get_i16(&payload[1]);
        base_rpm = proto_get_i32(&payload[3]);
        max_turn_rpm = 0;
        break;
    case 1U:
        if (len < 11U) {
            proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        target_yaw = proto_get_i16(&payload[1]);
        base_rpm = proto_get_i32(&payload[3]);
        max_turn_rpm = proto_get_i32(&payload[7]);
        break;
    default:
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    if ((base_rpm > 1200) || (base_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    if ((max_turn_rpm > 1200) || (max_turn_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_set_angle(target_yaw, base_rpm, max_turn_rpm);
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_ANGLE_MS);
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SET_ANGLE, seq, NULL, 0U);
}

static void proto_handle_angle_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_ANGLE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_ANGLE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_ANGLE_STOP, seq, NULL, 0U);
}

static void proto_handle_set_distance(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int32_t target_dist_mm;
    int32_t max_rpm;

    if ((proto_caps() & PROTO_CAP_DISTANCE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 8U) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    target_dist_mm = proto_get_i32(&payload[0]);
    max_rpm = proto_get_i32(&payload[4]);
    if ((max_rpm > 1200) || (max_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_set_distance(target_dist_mm, max_rpm);
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_DISTANCE_MS);
    proto_reply_ack(PROTO_CMD_SET_DISTANCE, seq, NULL, 0U);
}

static void proto_handle_distance_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_DISTANCE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_DISTANCE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_reply_ack(PROTO_CMD_DISTANCE_STOP, seq, NULL, 0U);
}

static int16_t proto_float_deg_to_i16(float deg)
{
    if (deg >= 0.0f) {
        return (int16_t)(deg + 0.5f);
    }
    return (int16_t)(deg - 0.5f);
}

static void proto_handle_calib_yaw(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int16_t ref_yaw_i16;
    float ref_yaw;
    float offset_deg;
    float yaw_deg;
    uint8_t ack[4];
    status_t st;

    if ((proto_caps() & PROTO_CAP_YAW_CALIB) == 0U) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len != 2U) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    ref_yaw_i16 = proto_get_i16(payload);
    if ((ref_yaw_i16 < -180) || (ref_yaw_i16 > 180)) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);

    ref_yaw = (float)ref_yaw_i16;
    st = attitude_calibrate_yaw(ref_yaw, &offset_deg, &yaw_deg);
    if (st == STATUS_FAIL) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_BUSY);
        return;
    }
    if (st == STATUS_INVALID_STATE) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (st != STATUS_OK) {
        proto_reply_nak(PROTO_CMD_CALIB_YAW, seq, PROTO_ERR_NVS_WRITE_FAIL);
        return;
    }

    proto_put_i16(&ack[0], proto_float_deg_to_i16(offset_deg));
    proto_put_i16(&ack[2], proto_float_deg_to_i16(yaw_deg));
    proto_reply_ack(PROTO_CMD_CALIB_YAW, seq, ack, (uint16_t)sizeof(ack));
}

static void proto_dispatch(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len)
{
    if ((cmd == PROTO_CMD_SUBSCRIBE) || (cmd == PROTO_CMD_UNSUBSCRIBE) ||
        (cmd == PROTO_CMD_SET_SPEED) || (cmd == PROTO_CMD_SPEED_STOP) ||
        (cmd == PROTO_CMD_ANGLE_STOP) ||
        (cmd == PROTO_CMD_SET_DISTANCE) || (cmd == PROTO_CMD_DISTANCE_STOP) ||
        (cmd == PROTO_CMD_CALIB_YAW) ||
        (cmd == PROTO_CMD_DRIVE) || (cmd == PROTO_CMD_DRIVE_STOP)) {
        proto_rx_gate_hold_cmd();
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_MS);
    }

    /* SET_ANGLE 不抑制推送：角度环遥测是观察机动状态的唯一途径 */
    if (cmd == PROTO_CMD_SET_ANGLE) {
        proto_rx_gate_hold_cmd();
    }

    switch (cmd) {
    case PROTO_CMD_HELLO:
        proto_handle_hello(seq);
        break;
    case PROTO_CMD_PING:
        proto_handle_ping(seq);
        break;
    case PROTO_CMD_GET_TELEMETRY:
        proto_handle_get_telemetry(seq);
        break;
    case PROTO_CMD_SUBSCRIBE:
        proto_handle_subscribe(seq, payload, len);
        break;
    case PROTO_CMD_UNSUBSCRIBE:
        proto_handle_unsubscribe(seq, payload, len);
        break;
    case PROTO_CMD_PARAM_LIST:
        proto_handle_param_list(seq);
        break;
    case PROTO_CMD_PARAM_READ:
        proto_handle_param_read(seq, payload, len);
        break;
    case PROTO_CMD_PARAM_WRITE:
        proto_handle_param_write(seq, payload, len);
        break;
    case PROTO_CMD_DRIVE:
        proto_handle_drive(seq, payload, len);
        break;
    case PROTO_CMD_DRIVE_STOP:
        proto_handle_drive_stop(seq);
        break;
    case PROTO_CMD_SET_SPEED:
        proto_handle_set_speed(seq, payload, len);
        break;
    case PROTO_CMD_SPEED_STOP:
        proto_handle_speed_stop(seq);
        break;
    case PROTO_CMD_SET_ANGLE:
        proto_handle_set_angle(seq, payload, len);
        break;
    case PROTO_CMD_ANGLE_STOP:
        proto_handle_angle_stop(seq);
        break;
    case PROTO_CMD_SET_DISTANCE:
        proto_handle_set_distance(seq, payload, len);
        break;
    case PROTO_CMD_DISTANCE_STOP:
        proto_handle_distance_stop(seq);
        break;
    case PROTO_CMD_CALIB_YAW:
        proto_handle_calib_yaw(seq, payload, len);
        break;
    default:
        proto_reply_nak(cmd, seq, PROTO_ERR_UNKNOWN_CMD);
        break;
    }
}

