indexxue/TM4C123GH6PM/Common/src/proto.c
/* -------------------------------------------------------------------------- */
/* 帧解析                                                                     */
/* -------------------------------------------------------------------------- */

static bool_t proto_rx_set_speed_semantic_ok(const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int32_t rpm;

    if ((payload == NULL) || (len < 1U)) {
        return FALSE;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len != 6U) {
            return FALSE;
        }
        if ((payload[1] < 1U) || (payload[1] > PROTO_ENCODER_COUNT)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[2]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        return TRUE;
    case 1U:
        if (len != 9U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[1]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[5]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        return TRUE;
    case 2U:
        return (len == 17U);
    default:
        return FALSE;
    }
}

static bool_t proto_rx_set_angle_semantic_ok(const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int32_t rpm;

    if ((payload == NULL) || (len < 1U)) {
        return FALSE;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len != 7U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[3]);
        return (rpm <= 1200) && (rpm >= -1200);
    case 1U:
        if (len != 11U) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[3]);
        if ((rpm > 1200) || (rpm < -1200)) {
            return FALSE;
        }
        rpm = proto_get_i32(&payload[7]);
        return (rpm <= 1200) && (rpm >= -1200);
    default:
        return FALSE;
    }
}

/**
 * HC-05 等蓝牙链路上常见「帧体正确、CRC 尾字节损坏」。
 * 在严格 CRC 失败时，若头/载荷语义自洽则放宽接受（仍由 dispatch 做业务校验）。
 */
static bool_t proto_rx_relaxed_crc_ok(uint16_t cmd, const uint8_t *hdr, const uint8_t *payload,
                                      uint16_t len)
{
    if ((hdr == NULL) || (hdr[0] != PROTO_VER) || ((hdr[1] & PROTO_FLAG_DIR_DEVICE) != 0U)) {
        return FALSE;
    }

    switch (cmd) {
    case PROTO_CMD_HELLO:
    case PROTO_CMD_PING:
    case PROTO_CMD_GET_TELEMETRY:
    case PROTO_CMD_SPEED_STOP:
    case PROTO_CMD_ANGLE_STOP:
    case PROTO_CMD_DRIVE_STOP:
    case PROTO_CMD_PARAM_LIST:
        return (len == 0U);
    case PROTO_CMD_SUBSCRIBE:
        return (len == 4U) || (len == 9U) || (len == 10U);
    case PROTO_CMD_UNSUBSCRIBE:
        return (len >= 4U);
    case PROTO_CMD_SET_SPEED:
        return proto_rx_set_speed_semantic_ok(payload, len);
    case PROTO_CMD_SET_ANGLE:
        return proto_rx_set_angle_semantic_ok(payload, len);
    case PROTO_CMD_CALIB_YAW:
        return (len == 2U);
    case PROTO_CMD_DRIVE:
        if (len != 4U) {
            return FALSE;
        }
        {
            int16_t throttle = proto_get_i16(&payload[0]);
            int16_t steer = proto_get_i16(&payload[2]);
            if ((throttle < -PROTO_DRIVE_THROTTLE_MAX) || (throttle > PROTO_DRIVE_THROTTLE_MAX) ||
                (steer < -PROTO_DRIVE_STEER_MAX) || (steer > PROTO_DRIVE_STEER_MAX)) {
                return FALSE;
            }
        }
        return TRUE;
    case PROTO_CMD_PARAM_READ:
        return (len == 2U);
    case PROTO_CMD_PARAM_WRITE:
        return (len >= 3U);
    default:
        return FALSE;
    }
}

static void proto_parse_reset(void)
{
    s_parser.state = PROTO_PARSE_SOF0;
    s_parser.body_len = 0U;
    proto_rx_gate_hold();
}

static void proto_parse_byte(uint8_t byte)
{
    uint16_t payload_len;
    uint16_t crc_expected;
    uint16_t crc_actual;
    uint16_t cmd;
    uint8_t seq;
    const uint8_t *payload;

    switch (s_parser.state) {
    case PROTO_PARSE_SOF0:
        if (byte == PROTO_SOF0) {
            s_parser.state = PROTO_PARSE_SOF1;
            proto_rx_gate_hold();
        }
        break;
    case PROTO_PARSE_SOF1:
        if (byte == PROTO_SOF1) {
            s_parser.body_len = 0U;
            s_parser.state = PROTO_PARSE_BODY;
            proto_rx_gate_hold();
        } else if (byte == PROTO_SOF0) {
            s_parser.state = PROTO_PARSE_SOF1;
            proto_rx_gate_hold();
        } else {
            s_parser.state = PROTO_PARSE_SOF0;
        }
        break;
    case PROTO_PARSE_BODY:
        s_parser.body[s_parser.body_len++] = byte;
        proto_rx_gate_hold();
        if (s_parser.body_len < (PROTO_HEADER_SIZE + 2U)) {
            break;
        }
        payload_len = proto_get_u16(&s_parser.body[2]);
        if (payload_len > PROTO_MAX_PAYLOAD) {
            proto_parse_reset();
            break;
        }
        if (s_parser.body_len < (uint16_t)(PROTO_HEADER_SIZE + payload_len + 2U)) {
            break;
        }

        crc_expected = proto_get_u16(&s_parser.body[PROTO_HEADER_SIZE + payload_len]);
        crc_actual = proto_crc16_ccitt_false(s_parser.body,
                                             (uint16_t)(PROTO_HEADER_SIZE + payload_len));
        cmd = proto_get_u16(&s_parser.body[4]);
        seq = s_parser.body[6];
        payload = (payload_len > 0U) ? &s_parser.body[PROTO_HEADER_SIZE] : NULL;

        if (crc_actual != crc_expected) {
            if (!proto_rx_relaxed_crc_ok(cmd, s_parser.body, payload, payload_len)) {
                LOG_WARN(
                    "proto: rx crc fail len=%u exp=0x%04x got=0x%04x "
                    "cmd=0x%04x seq=%u body=%02x%02x%02x%02x%02x%02x%02x%02x",
                    (unsigned)payload_len,
                    (unsigned)crc_expected,
                    (unsigned)crc_actual,
                    (unsigned)cmd,
                    (unsigned)seq,
                    s_parser.body[0],
                    s_parser.body[1],
                    s_parser.body[2],
                    s_parser.body[3],
                    s_parser.body[4],
                    s_parser.body[5],
                    s_parser.body[6],
                    s_parser.body[7]);
                proto_parse_reset();
                break;
            }
            LOG_WARN(
                "proto: rx crc relaxed accept cmd=0x%04x seq=%u (wire=0x%04x body=0x%04x)",
                (unsigned)cmd,
                (unsigned)seq,
                (unsigned)crc_expected,
                (unsigned)crc_actual);
        }

        if (s_parser.body[1] & PROTO_FLAG_DIR_DEVICE) {
            proto_parse_reset();
            break;
        }

