indexxue/TM4C123GH6PM/Common/src/proto.c
        if ((cmd != PROTO_CMD_PING) && (cmd != PROTO_CMD_GET_TELEMETRY)) {
            LOG_INFO("proto: rx cmd=0x%04x seq=%u len=%u", (unsigned)cmd, (unsigned)seq,
                     (unsigned)payload_len);
        }
        proto_dispatch(cmd, seq, payload, payload_len);
        proto_parse_reset();
        break;
    default:
        proto_parse_reset();
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* RX 任务                                                                    */
/* -------------------------------------------------------------------------- */

static void proto_rx_task(void *arg)
{
    static bool s_stack_logged;

    (void)arg;

    for (;;) {
        if (!s_stack_logged) {
            s_stack_logged = true;
            LOG_INFO("proto: stack hw proto_rx=%u words",
                     (unsigned)uxTaskGetStackHighWaterMark(NULL));
        }

        char ch;

        while (UART_Getc(&ch) != 0) {
            if (s_echo_mode) {
                UART_Putc(ch);
                continue;
            }
            proto_parse_byte((uint8_t)ch);
        }
        vTaskDelay(pdMS_TO_TICKS(PROTO_RX_POLL_MS));
    }
}

void proto_telemetry_tick(uint32_t period_ms)
{
    if (s_drive_stop_req) {
        proto_motor_all_stop();
        s_drive_stop_req = false;
        s_drive_active = false;
    } else if (s_drive_active) {
        uint32_t now = proto_uptime_ms();

        if ((now - s_drive_last_ms) > PROTO_DRIVE_TIMEOUT_MS) {
            proto_motor_all_stop();
            s_drive_active = false;
        } else {
            proto_apply_drive(s_drive_throttle, s_drive_steer);
        }
    }

    if (proto_push_blocked()) {
        return;
    }

    if (s_base.active != FALSE) {
        s_base.acc_att_ms += period_ms;
        if (s_base.acc_att_ms >= proto_period_ms_for(s_base.hz_att, PROTO_DEFAULT_HZ_ATT)) {
            s_base.acc_att_ms = 0U;
            proto_push_attitude();
        }
        s_base.acc_enc_ms += period_ms;
        if (s_base.acc_enc_ms >= proto_period_ms_for(s_base.hz_enc, PROTO_DEFAULT_HZ_ENC)) {
            s_base.acc_enc_ms = 0U;
            proto_push_encoder();
        }
    }

    if ((s_sub.mask & PROTO_CH_BATTERY) != 0U) {
        s_sub.acc_batt_ms += period_ms;
        if (s_sub.acc_batt_ms >= proto_period_ms_for(s_sub.hz_batt, PROTO_DEFAULT_HZ_BATT)) {
            s_sub.acc_batt_ms = 0U;
            proto_push_battery();
        }
    }
    if ((s_sub.mask & PROTO_CH_LINE_ADC) != 0U) {
        s_sub.acc_line_ms += period_ms;
        if (s_sub.acc_line_ms >= proto_period_ms_for(s_sub.hz_line, PROTO_DEFAULT_HZ_LINE)) {
            s_sub.acc_line_ms = 0U;
            proto_push_line_adc();
        }
    }
    if ((s_sub.mask & PROTO_CH_ULTRASONIC) != 0U) {
        s_sub.acc_ultra_ms += period_ms;
        if (s_sub.acc_ultra_ms >= proto_period_ms_for(s_sub.hz_ultra, PROTO_DEFAULT_HZ_ULTRA)) {
            s_sub.acc_ultra_ms = 0U;
            proto_push_ultrasonic();
        }
    }
    if ((s_sub.mask & PROTO_CH_MOTOR_RPM) != 0U) {
        s_sub.acc_motor_rpm_ms += period_ms;
        if (s_sub.acc_motor_rpm_ms >=
            proto_period_ms_for(s_sub.hz_motor_rpm, PROTO_DEFAULT_HZ_MOTOR_RPM)) {
            s_sub.acc_motor_rpm_ms = 0U;
            proto_push_motor_rpm();
        }
    }
    if ((s_sub.mask & PROTO_CH_ANGLE_LOOP) != 0U) {
        s_sub.acc_angle_loop_ms += period_ms;
        if (s_sub.acc_angle_loop_ms >=
            proto_period_ms_for(s_sub.hz_angle_loop, PROTO_DEFAULT_HZ_ANGLE_LOOP)) {
            s_sub.acc_angle_loop_ms = 0U;
            proto_push_angle_loop();
        }
    }
    if ((s_sub.mask & PROTO_CH_DISTANCE_LOOP) != 0U) {
        s_sub.acc_distance_loop_ms += period_ms;
        if (s_sub.acc_distance_loop_ms >=
            proto_period_ms_for(s_sub.hz_distance_loop, PROTO_DEFAULT_HZ_DISTANCE_LOOP)) {
            s_sub.acc_distance_loop_ms = 0U;
            proto_push_distance_loop();
        }
    }
}

status_t proto_uart_service_start(void)
{
    if (s_rx_task != NULL) {
        return STATUS_OK;
    }

    if (s_tx_mutex == NULL) {
        s_tx_mutex = xSemaphoreCreateMutex();
        if (s_tx_mutex == NULL) {
            return STATUS_NO_MEM;
        }
    }

    if (s_tx_queue == NULL) {
        s_tx_queue = xQueueCreate(PROTO_TX_QUEUE_LEN, sizeof(proto_tx_item_t));
        if (s_tx_queue == NULL) {
            return STATUS_NO_MEM;
        }
    }

    if (s_tx_task == NULL) {
        if (xTaskCreate(proto_tx_task, PROTO_TASK_NAME_TX, PROTO_TX_STACK_WORDS, NULL,
                        PROTO_TX_PRIORITY, &s_tx_task) != pdPASS) {
            LOG_ERROR("proto: create tx task failed");
            vQueueDelete(s_tx_queue);
            s_tx_queue = NULL;
            vSemaphoreDelete(s_tx_mutex);
            s_tx_mutex = NULL;
            return STATUS_FAIL;
        }
    }

    proto_parse_reset();
    (void)memset(&s_base, 0, sizeof(s_base));
    (void)memset(&s_sub, 0, sizeof(s_sub));
    s_base.active = TRUE;
    s_base.hz_att = PROTO_DEFAULT_HZ_ATT;
    s_base.hz_enc = PROTO_DEFAULT_HZ_ENC;
    s_sub.hz_line = PROTO_DEFAULT_HZ_LINE;
    s_sub.hz_ultra = PROTO_DEFAULT_HZ_ULTRA;
    s_sub.hz_motor_rpm = PROTO_DEFAULT_HZ_MOTOR_RPM;
    s_sub.hz_angle_loop = PROTO_DEFAULT_HZ_ANGLE_LOOP;
    s_sub.hz_distance_loop = PROTO_DEFAULT_HZ_DISTANCE_LOOP;
    s_sub.hz_batt = PROTO_DEFAULT_HZ_BATT;
    s_ultra_ready = FALSE;
    s_ultra_init_attempted = FALSE;

    if (xTaskCreate(proto_rx_task, PROTO_TASK_NAME_RX, PROTO_RX_STACK_WORDS, NULL,
                    PROTO_RX_PRIORITY, &s_rx_task) != pdPASS) {
        LOG_ERROR("proto: create rx task failed");
        vTaskDelete(s_tx_task);
        s_tx_task = NULL;
        vQueueDelete(s_tx_queue);
        s_tx_queue = NULL;
        vSemaphoreDelete(s_tx_mutex);
        s_tx_mutex = NULL;
        s_rx_task = NULL;
        return STATUS_FAIL;
    }

    LOG_INFO("proto: uart0 service ready");
    return STATUS_OK;
}

void proto_echo_set(bool_t enable)
{
    s_echo_mode = enable;
    if (enable) {
        proto_parse_reset();
    }
    LOG_INFO("proto: echo %s", enable ? "on" : "off");
}

bool_t proto_echo_get(void)
{
    return s_echo_mode;
}

void proto_send_raw(const uint8_t *data, uint16_t len)
{
    if ((data == NULL) || (len == 0U)) {
        return;
    }
    (void)proto_enqueue_frame_bytes(data, len, FALSE);
}
